-- Для каждой пары последовательных дат, dt1 и dt2, поступления средств (таблица Income_o) найти сумму выдачи денег (таблица Outcome_o) в полуоткрытом интервале (dt1, dt2].
-- Вывод: сумма, левая граница интервала, правая граница интервала.

-- Я так и не смог понять каким образом из данного условия получается данный ответ. Ведь в ответе представлены пары дат, которые не всегда последовательны 
-- (Либо я не понимаю, что имеется в виду под этим термином)


-- Вот код, который отбирает пары последовательных дат из Income_o

WITH double_date AS (SELECT date, LEAD(date) OVER(ORDER BY date) AS nextDATE
FROM Income_o)

SELECT *
FROM double_date
WHERE DATEDIFF(DAY, date, nextDATE) = 1
