-- Историки решили составить отчет о битвах в два суперстолбца. Каждый суперстолбец состоит из трёх столбцов (номер битвы, название и дата).
-- Сначала в порядке возрастания номеров заполняется первый суперстолбец, потом - второй. Порядковый номер битве назначается согласно сортировке: дата, название.
-- С целью экономии бумаги, историки делят информацию из таблицы Battles поровну, занося в первый суперстолбец на одну битву больше при их нечетном количестве.
-- В таблицу с шестью колонками вывести результат работы историков, пустые места заполнить NULL-значениями.


WITH sup_Col AS 
(SELECT row_number() OVER(ORDER BY date, name) number,
COUNT(*) OVER() total, name, date
FROM Battles)
SELECT a.number, a.name, a.date,  b.number, b.name, b.date
FROM sup_Col AS a LEFT JOIN sup_Col AS b
ON a.number = b.number - (b.total / 2 + b.total % 2)
WHERE a.number <= a.total / 2 + a.total % 2
